flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:398:14)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #6   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #7   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #8   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #9   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #10   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #11   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #12   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #13   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: │ #14   _startMicrotaskLoop (dart:async/schedule_microtask.dart:49:5)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:40.121 (+0:01:12.637591)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 ✅ Сокет успешно подключен
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:410:18)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #6   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #7   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #8   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #9   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #10   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #11   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #12   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #13   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: │ #14   _startMicrotaskLoop (dart:async/schedule_microtask.dart:49:5)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:40.127 (+0:01:12.643971)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📡 Отправлена информация о водителе онлайн
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._sendLocationUpdate (package:aktau_go/ui/orders/orders_wm.dart:826:16)
flutter: │ #1   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:414:13)
flutter: │ #2   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #3   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #4   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #5   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #6   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:40.130 (+0:01:12.647143)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 Координаты отправлены на сервер: 43.231868663777405, 76.83192872219117
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:427:14)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onclose (package:socket_io_client/src/socket.dart:390:5)
flutter: │ #6   Socket.ondisconnect (package:socket_io_client/src/socket.dart:563:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:424:9)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:40.135 (+0:01:12.651216)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ ⚠️ 🔌 Сокет отключен: io server disconnect
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:432:16)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onclose (package:socket_io_client/src/socket.dart:390:5)
flutter: │ #6   Socket.ondisconnect (package:socket_io_client/src/socket.dart:563:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:424:9)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:40.137 (+0:01:12.653250)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🔄 Попытка автоматического переподключения...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.disconnectWebsocket (package:aktau_go/ui/orders/orders_wm.dart:682:16)
flutter: │ #1   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:331:11)
flutter: │ #2   OrdersWM._setupSocketEventHandlers.<anonymous closure>.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:435:13)
flutter: │ #3   new Future.delayed.<anonymous closure> (dart:async/future.dart:419:42)
flutter: │ #4   Timer._createTimer.<anonymous closure> (dart:async-patch/timer_patch.dart:18:15)
flutter: │ #5   _Timer._runTimers (dart:isolate-patch/timer_impl.dart:410:19)
flutter: │ #6   _Timer._handleMessage (dart:isolate-patch/timer_impl.dart:441:5)
flutter: │ #7   _RawReceivePort._handleMessage (dart:isolate-patch/isolate_patch.dart:193:12)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:43.142 (+0:01:15.658413)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🔌 Отключаем сокет...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.disconnectWebsocket (package:aktau_go/ui/orders/orders_wm.dart:705:16)
flutter: │ #1   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:331:11)
flutter: │ #2   OrdersWM._setupSocketEventHandlers.<anonymous closure>.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:435:13)
flutter: │ #3   new Future.delayed.<anonymous closure> (dart:async/future.dart:419:42)
flutter: │ #4   Timer._createTimer.<anonymous closure> (dart:async-patch/timer_patch.dart:18:15)
flutter: │ #5   _Timer._runTimers (dart:isolate-patch/timer_impl.dart:410:19)
flutter: │ #6   _Timer._handleMessage (dart:isolate-patch/timer_impl.dart:441:5)
flutter: │ #7   _RawReceivePort._handleMessage (dart:isolate-patch/isolate_patch.dart:193:12)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:43.145 (+0:01:15.662172)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 ✅ Сокет отключен и очищен
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:350:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:48.391 (+0:01:20.907643)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🚀 Инициализация сокета...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:351:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:48.393 (+0:01:20.910131)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 SessionId: e2185077-9db2-45b3-a234-4314dc1dd58a
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:352:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:48.395 (+0:01:20.911546)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 DriverId: 1ec2f0c8-4392-451e-b4a9-6eb326282f4f
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:353:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:48.396 (+0:01:20.912380)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 Position: 43.231868662973454, 76.83192872185651
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers (package:aktau_go/ui/orders/orders_wm.dart:643:12)
flutter: │ #1   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:377:7)
flutter: │ #2   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:48.397 (+0:01:20.913472)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🎯 Все обработчики событий настроены
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:381:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:48.398 (+0:01:20.915000)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🔌 Сокет создан и подключается...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:398:14)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #6   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #7   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #8   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #9   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #10   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #11   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #12   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #13   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: │ #14   _startMicrotaskLoop (dart:async/schedule_microtask.dart:49:5)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:49.486 (+0:01:22.002846)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 ✅ Сокет успешно подключен
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:410:18)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #6   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #7   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #8   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #9   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #10   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #11   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #12   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #13   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: │ #14   _startMicrotaskLoop (dart:async/schedule_microtask.dart:49:5)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:49.493 (+0:01:22.009800)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📡 Отправлена информация о водителе онлайн
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._sendLocationUpdate (package:aktau_go/ui/orders/orders_wm.dart:826:16)
flutter: │ #1   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:414:13)
flutter: │ #2   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #3   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #4   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #5   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #6   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:49.497 (+0:01:22.013319)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 Координаты отправлены на сервер: 43.231868662973454, 76.83192872185651
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:427:14)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onclose (package:socket_io_client/src/socket.dart:390:5)
flutter: │ #6   Socket.ondisconnect (package:socket_io_client/src/socket.dart:563:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:424:9)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:49.501 (+0:01:22.017839)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ ⚠️ 🔌 Сокет отключен: io server disconnect
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:432:16)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onclose (package:socket_io_client/src/socket.dart:390:5)
flutter: │ #6   Socket.ondisconnect (package:socket_io_client/src/socket.dart:563:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:424:9)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:49.503 (+0:01:22.019825)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🔄 Попытка автоматического переподключения...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.disconnectWebsocket (package:aktau_go/ui/orders/orders_wm.dart:682:16)
flutter: │ #1   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:331:11)
flutter: │ #2   OrdersWM._setupSocketEventHandlers.<anonymous closure>.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:435:13)
flutter: │ #3   new Future.delayed.<anonymous closure> (dart:async/future.dart:419:42)
flutter: │ #4   Timer._createTimer.<anonymous closure> (dart:async-patch/timer_patch.dart:18:15)
flutter: │ #5   _Timer._runTimers (dart:isolate-patch/timer_impl.dart:410:19)
flutter: │ #6   _Timer._handleMessage (dart:isolate-patch/timer_impl.dart:441:5)
flutter: │ #7   _RawReceivePort._handleMessage (dart:isolate-patch/isolate_patch.dart:193:12)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:52.507 (+0:01:25.024008)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🔌 Отключаем сокет...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.disconnectWebsocket (package:aktau_go/ui/orders/orders_wm.dart:705:16)
flutter: │ #1   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:331:11)
flutter: │ #2   OrdersWM._setupSocketEventHandlers.<anonymous closure>.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:435:13)
flutter: │ #3   new Future.delayed.<anonymous closure> (dart:async/future.dart:419:42)
flutter: │ #4   Timer._createTimer.<anonymous closure> (dart:async-patch/timer_patch.dart:18:15)
flutter: │ #5   _Timer._runTimers (dart:isolate-patch/timer_impl.dart:410:19)
flutter: │ #6   _Timer._handleMessage (dart:isolate-patch/timer_impl.dart:441:5)
flutter: │ #7   _RawReceivePort._handleMessage (dart:isolate-patch/isolate_patch.dart:193:12)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:52.511 (+0:01:25.027762)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 ✅ Сокет отключен и очищен
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:350:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:52.521 (+0:01:25.037380)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🚀 Инициализация сокета...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:351:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:52.522 (+0:01:25.038841)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 SessionId: e2185077-9db2-45b3-a234-4314dc1dd58a
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:352:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:52.523 (+0:01:25.039790)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 DriverId: 1ec2f0c8-4392-451e-b4a9-6eb326282f4f
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:353:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:52.524 (+0:01:25.040640)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 Position: 43.231868662973454, 76.83192872185651
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers (package:aktau_go/ui/orders/orders_wm.dart:643:12)
flutter: │ #1   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:377:7)
flutter: │ #2   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:52.525 (+0:01:25.041826)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🎯 Все обработчики событий настроены
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:381:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:52.527 (+0:01:25.043890)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🔌 Сокет создан и подключается...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:398:14)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #6   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #7   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #8   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #9   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #10   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #11   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #12   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #13   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: │ #14   _startMicrotaskLoop (dart:async/schedule_microtask.dart:49:5)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:53.650 (+0:01:26.166257)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 ✅ Сокет успешно подключен
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:410:18)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #6   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #7   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #8   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #9   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #10   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #11   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #12   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #13   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: │ #14   _startMicrotaskLoop (dart:async/schedule_microtask.dart:49:5)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:53.656 (+0:01:26.172407)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📡 Отправлена информация о водителе онлайн
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._sendLocationUpdate (package:aktau_go/ui/orders/orders_wm.dart:826:16)
flutter: │ #1   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:414:13)
flutter: │ #2   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #3   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #4   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #5   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #6   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:53.659 (+0:01:26.175593)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 Координаты отправлены на сервер: 43.231868662973454, 76.83192872185651
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:427:14)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onclose (package:socket_io_client/src/socket.dart:390:5)
flutter: │ #6   Socket.ondisconnect (package:socket_io_client/src/socket.dart:563:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:424:9)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:53.663 (+0:01:26.179345)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ ⚠️ 🔌 Сокет отключен: io server disconnect
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:432:16)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onclose (package:socket_io_client/src/socket.dart:390:5)
flutter: │ #6   Socket.ondisconnect (package:socket_io_client/src/socket.dart:563:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:424:9)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:53.665 (+0:01:26.181577)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🔄 Попытка автоматического переподключения...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.disconnectWebsocket (package:aktau_go/ui/orders/orders_wm.dart:682:16)
flutter: │ #1   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:331:11)
flutter: │ #2   OrdersWM._setupSocketEventHandlers.<anonymous closure>.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:435:13)
flutter: │ #3   new Future.delayed.<anonymous closure> (dart:async/future.dart:419:42)
flutter: │ #4   Timer._createTimer.<anonymous closure> (dart:async-patch/timer_patch.dart:18:15)
flutter: │ #5   _Timer._runTimers (dart:isolate-patch/timer_impl.dart:410:19)
flutter: │ #6   _Timer._handleMessage (dart:isolate-patch/timer_impl.dart:441:5)
flutter: │ #7   _RawReceivePort._handleMessage (dart:isolate-patch/isolate_patch.dart:193:12)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:56.670 (+0:01:29.186409)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🔌 Отключаем сокет...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.disconnectWebsocket (package:aktau_go/ui/orders/orders_wm.dart:705:16)
flutter: │ #1   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:331:11)
flutter: │ #2   OrdersWM._setupSocketEventHandlers.<anonymous closure>.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:435:13)
flutter: │ #3   new Future.delayed.<anonymous closure> (dart:async/future.dart:419:42)
flutter: │ #4   Timer._createTimer.<anonymous closure> (dart:async-patch/timer_patch.dart:18:15)
flutter: │ #5   _Timer._runTimers (dart:isolate-patch/timer_impl.dart:410:19)
flutter: │ #6   _Timer._handleMessage (dart:isolate-patch/timer_impl.dart:441:5)
flutter: │ #7   _RawReceivePort._handleMessage (dart:isolate-patch/isolate_patch.dart:193:12)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:45:56.674 (+0:01:29.190285)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 ✅ Сокет отключен и очищен
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:350:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:00.387 (+0:01:32.903631)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🚀 Инициализация сокета...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:351:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:00.388 (+0:01:32.904953)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 SessionId: e2185077-9db2-45b3-a234-4314dc1dd58a
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:352:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:00.389 (+0:01:32.905705)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 DriverId: 1ec2f0c8-4392-451e-b4a9-6eb326282f4f
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:353:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:00.390 (+0:01:32.906479)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 Position: 43.23186866229701, 76.83192872157491
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers (package:aktau_go/ui/orders/orders_wm.dart:643:12)
flutter: │ #1   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:377:7)
flutter: │ #2   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:00.391 (+0:01:32.907456)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🎯 Все обработчики событий настроены
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:381:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:00.393 (+0:01:32.909197)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🔌 Сокет создан и подключается...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:398:14)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #6   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #7   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #8   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #9   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #10   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #11   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #12   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #13   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: │ #14   _startMicrotaskLoop (dart:async/schedule_microtask.dart:49:5)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:01.561 (+0:01:34.077979)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 ✅ Сокет успешно подключен
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:410:18)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #6   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #7   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #8   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #9   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #10   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #11   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #12   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #13   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: │ #14   _startMicrotaskLoop (dart:async/schedule_microtask.dart:49:5)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:01.568 (+0:01:34.084515)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📡 Отправлена информация о водителе онлайн
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._sendLocationUpdate (package:aktau_go/ui/orders/orders_wm.dart:826:16)
flutter: │ #1   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:414:13)
flutter: │ #2   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #3   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #4   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #5   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #6   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:01.571 (+0:01:34.087720)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 Координаты отправлены на сервер: 43.23186866229701, 76.83192872157491
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:427:14)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onclose (package:socket_io_client/src/socket.dart:390:5)
flutter: │ #6   Socket.ondisconnect (package:socket_io_client/src/socket.dart:563:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:424:9)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:01.575 (+0:01:34.092025)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ ⚠️ 🔌 Сокет отключен: io server disconnect
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:432:16)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onclose (package:socket_io_client/src/socket.dart:390:5)
flutter: │ #6   Socket.ondisconnect (package:socket_io_client/src/socket.dart:563:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:424:9)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:01.577 (+0:01:34.094084)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🔄 Попытка автоматического переподключения...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.disconnectWebsocket (package:aktau_go/ui/orders/orders_wm.dart:682:16)
flutter: │ #1   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:331:11)
flutter: │ #2   OrdersWM._setupSocketEventHandlers.<anonymous closure>.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:435:13)
flutter: │ #3   new Future.delayed.<anonymous closure> (dart:async/future.dart:419:42)
flutter: │ #4   Timer._createTimer.<anonymous closure> (dart:async-patch/timer_patch.dart:18:15)
flutter: │ #5   _Timer._runTimers (dart:isolate-patch/timer_impl.dart:410:19)
flutter: │ #6   _Timer._handleMessage (dart:isolate-patch/timer_impl.dart:441:5)
flutter: │ #7   _RawReceivePort._handleMessage (dart:isolate-patch/isolate_patch.dart:193:12)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:04.582 (+0:01:37.098865)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🔌 Отключаем сокет...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.disconnectWebsocket (package:aktau_go/ui/orders/orders_wm.dart:705:16)
flutter: │ #1   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:331:11)
flutter: │ #2   OrdersWM._setupSocketEventHandlers.<anonymous closure>.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:435:13)
flutter: │ #3   new Future.delayed.<anonymous closure> (dart:async/future.dart:419:42)
flutter: │ #4   Timer._createTimer.<anonymous closure> (dart:async-patch/timer_patch.dart:18:15)
flutter: │ #5   _Timer._runTimers (dart:isolate-patch/timer_impl.dart:410:19)
flutter: │ #6   _Timer._handleMessage (dart:isolate-patch/timer_impl.dart:441:5)
flutter: │ #7   _RawReceivePort._handleMessage (dart:isolate-patch/isolate_patch.dart:193:12)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:04.586 (+0:01:37.102458)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 ✅ Сокет отключен и очищен
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:350:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:04.595 (+0:01:37.111480)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🚀 Инициализация сокета...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:351:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:04.596 (+0:01:37.112558)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 SessionId: e2185077-9db2-45b3-a234-4314dc1dd58a
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:352:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:04.597 (+0:01:37.113515)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 DriverId: 1ec2f0c8-4392-451e-b4a9-6eb326282f4f
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:353:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:04.598 (+0:01:37.114327)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 Position: 43.23186866229701, 76.83192872157491
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers (package:aktau_go/ui/orders/orders_wm.dart:643:12)
flutter: │ #1   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:377:7)
flutter: │ #2   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:04.599 (+0:01:37.115479)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🎯 Все обработчики событий настроены
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:381:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:04.601 (+0:01:37.117550)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🔌 Сокет создан и подключается...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:398:14)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #6   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #7   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #8   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #9   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #10   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #11   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #12   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #13   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: │ #14   _startMicrotaskLoop (dart:async/schedule_microtask.dart:49:5)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:05.726 (+0:01:38.242710)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 ✅ Сокет успешно подключен
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:410:18)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #6   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #7   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #8   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #9   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #10   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #11   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #12   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #13   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: │ #14   _startMicrotaskLoop (dart:async/schedule_microtask.dart:49:5)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:05.732 (+0:01:38.249091)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📡 Отправлена информация о водителе онлайн
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._sendLocationUpdate (package:aktau_go/ui/orders/orders_wm.dart:826:16)
flutter: │ #1   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:414:13)
flutter: │ #2   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #3   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #4   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #5   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #6   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:05.735 (+0:01:38.251801)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 Координаты отправлены на сервер: 43.23186866229701, 76.83192872157491
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:427:14)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onclose (package:socket_io_client/src/socket.dart:390:5)
flutter: │ #6   Socket.ondisconnect (package:socket_io_client/src/socket.dart:563:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:424:9)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:05.739 (+0:01:38.255577)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ ⚠️ 🔌 Сокет отключен: io server disconnect
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:432:16)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onclose (package:socket_io_client/src/socket.dart:390:5)
flutter: │ #6   Socket.ondisconnect (package:socket_io_client/src/socket.dart:563:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:424:9)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:05.741 (+0:01:38.257519)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🔄 Попытка автоматического переподключения...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.disconnectWebsocket (package:aktau_go/ui/orders/orders_wm.dart:682:16)
flutter: │ #1   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:331:11)
flutter: │ #2   OrdersWM._setupSocketEventHandlers.<anonymous closure>.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:435:13)
flutter: │ #3   new Future.delayed.<anonymous closure> (dart:async/future.dart:419:42)
flutter: │ #4   Timer._createTimer.<anonymous closure> (dart:async-patch/timer_patch.dart:18:15)
flutter: │ #5   _Timer._runTimers (dart:isolate-patch/timer_impl.dart:410:19)
flutter: │ #6   _Timer._handleMessage (dart:isolate-patch/timer_impl.dart:441:5)
flutter: │ #7   _RawReceivePort._handleMessage (dart:isolate-patch/isolate_patch.dart:193:12)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:08.745 (+0:01:41.261661)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🔌 Отключаем сокет...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.disconnectWebsocket (package:aktau_go/ui/orders/orders_wm.dart:705:16)
flutter: │ #1   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:331:11)
flutter: │ #2   OrdersWM._setupSocketEventHandlers.<anonymous closure>.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:435:13)
flutter: │ #3   new Future.delayed.<anonymous closure> (dart:async/future.dart:419:42)
flutter: │ #4   Timer._createTimer.<anonymous closure> (dart:async-patch/timer_patch.dart:18:15)
flutter: │ #5   _Timer._runTimers (dart:isolate-patch/timer_impl.dart:410:19)
flutter: │ #6   _Timer._handleMessage (dart:isolate-patch/timer_impl.dart:441:5)
flutter: │ #7   _RawReceivePort._handleMessage (dart:isolate-patch/isolate_patch.dart:193:12)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:08.749 (+0:01:41.265584)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 ✅ Сокет отключен и очищен
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:350:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:08.758 (+0:01:41.274230)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🚀 Инициализация сокета...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:351:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:08.759 (+0:01:41.275350)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 SessionId: e2185077-9db2-45b3-a234-4314dc1dd58a
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:352:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:08.760 (+0:01:41.276194)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 DriverId: 1ec2f0c8-4392-451e-b4a9-6eb326282f4f
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:353:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:08.760 (+0:01:41.277174)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 Position: 43.23186866107394, 76.83192872106576
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers (package:aktau_go/ui/orders/orders_wm.dart:643:12)
flutter: │ #1   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:377:7)
flutter: │ #2   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:08.762 (+0:01:41.278331)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🎯 Все обработчики событий настроены
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM.initializeSocket (package:aktau_go/ui/orders/orders_wm.dart:381:14)
flutter: │ #1   <asynchronous suspension>
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:08.764 (+0:01:41.280304)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🔌 Сокет создан и подключается...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:398:14)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #6   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #7   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #8   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #9   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #10   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #11   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #12   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #13   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: │ #14   _startMicrotaskLoop (dart:async/schedule_microtask.dart:49:5)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:09.926 (+0:01:42.442579)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 ✅ Сокет успешно подключен
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:410:18)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #6   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #7   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #8   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #9   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #10   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #11   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #12   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #13   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: │ #14   _startMicrotaskLoop (dart:async/schedule_microtask.dart:49:5)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:09.932 (+0:01:42.448504)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📡 Отправлена информация о водителе онлайн
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._sendLocationUpdate (package:aktau_go/ui/orders/orders_wm.dart:826:16)
flutter: │ #1   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:414:13)
flutter: │ #2   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #3   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #4   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #5   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #6   Socket.onconnect (package:socket_io_client/src/socket.dart:535:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:406:11)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:09.935 (+0:01:42.451581)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 📍 Координаты отправлены на сервер: 43.23186866107394, 76.83192872106576
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:427:14)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onclose (package:socket_io_client/src/socket.dart:390:5)
flutter: │ #6   Socket.ondisconnect (package:socket_io_client/src/socket.dart:563:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:424:9)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:09.939 (+0:01:42.455344)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ ⚠️ 🔌 Сокет отключен: io server disconnect
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: ┌───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
flutter: │ #0   OrdersWM._setupSocketEventHandlers.<anonymous closure> (package:aktau_go/ui/orders/orders_wm.dart:432:16)
flutter: │ #1   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #2   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #3   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #4   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #5   Socket.onclose (package:socket_io_client/src/socket.dart:390:5)
flutter: │ #6   Socket.ondisconnect (package:socket_io_client/src/socket.dart:563:5)
flutter: │ #7   Socket.onpacket (package:socket_io_client/src/socket.dart:424:9)
flutter: │ #8   EventEmitter._emit.<anonymous closure> (package:socket_io_common/src/util/event_emitter.dart:44:14)
flutter: │ #9   List.forEach (dart:core-patch/growable_array.dart:425:8)
flutter: │ #10   EventEmitter._emit (package:socket_io_common/src/util/event_emitter.dart:43:11)
flutter: │ #11   EventEmitter.emitReserved (package:socket_io_common/src/util/event_emitter.dart:57:47)
flutter: │ #12   Manager.ondecoded.<anonymous closure> (package:socket_io_client/src/manager.dart:288:7)
flutter: │ #13   new Future.microtask.<anonymous closure> (dart:async/future.dart:287:40)
flutter: │ #14   _microtaskLoop (dart:async/schedule_microtask.dart:40:21)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 01:46:09.941 (+0:01:42.457433)
flutter: ├┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄
flutter: │ 💡 🔄 Попытка автоматического переподключения...
flutter: └───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
